#language: ru

@tree

Функционал: Проверка создания сценария ручным вводом

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Заказ_поставщику_Приобретение_ТиУ (ручной ввод)

И В командном интерфейсе я выбираю "Закупки" "Заказы поставщикам"
Тогда открылось окно "Заказы поставщикам"
И в таблице 'Список' я нажимаю на кнопку с именем 'СписокСоздать'
Тогда открылось окно "Заказ поставщику (создание)"
И из выпадающего списка с именем 'Организация' я выбираю точное значение "Тестовая организация, ПАО"
И я нажимаю кнопку выбора у поля с именем 'Партнер'
Тогда открылось окно "Партнеры (Поставщики)"
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Заказ поставщику (создание) *"
И я нажимаю кнопку выбора у поля с именем 'Договор'
Тогда открылось окно "Договоры с контрагентами"
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Заказ поставщику (создание) *"
И я нажимаю кнопку выбора у поля с именем 'Склад'
Тогда открылось окно "Склады и магазины"
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Заказ поставщику (создание) *"
И я перехожу к закладке с именем 'ГруппаТовары'
И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
И в таблице 'Товары' я активизирую поле с именем 'ТоварыНоменклатура'
И в таблице 'Товары' я нажимаю кнопку выбора у реквизита с именем 'ТоварыНоменклатура'
Тогда открылось окно "Номенклатура"
И в таблице 'СписокРасширенныйПоискНоменклатура' я выбираю текущую строку
Тогда открылось окно "Заказ поставщику (создание) *"
И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличествоУпаковок'
И в таблице 'Товары' в поле с именем 'ТоварыКоличествоУпаковок' я ввожу текст "1,000"
И в таблице 'Товары' я активизирую поле с именем 'ТоварыЦена'
И в таблице 'Товары' в поле с именем 'ТоварыЦена' я ввожу текст "100,00"
И в таблице 'Товары' я завершаю редактирование строки
И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
И в таблице 'Товары' я активизирую поле с именем 'ТоварыНоменклатура'
И в таблице 'Товары' я нажимаю кнопку выбора у реквизита с именем 'ТоварыНоменклатура'
Тогда открылось окно "Номенклатура"
И в таблице 'СписокРасширенныйПоискНоменклатура' я перехожу к строке:
	| "Наименование"      |
	| "_Бумага наждачная" |
И в таблице 'СписокРасширенныйПоискНоменклатура' я выбираю текущую строку
Тогда открылось окно "Заказ поставщику (создание) *"
И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличествоУпаковок'
И в таблице 'Товары' в поле с именем 'ТоварыКоличествоУпаковок' я ввожу текст "2,000"
И в таблице 'Товары' я активизирую поле с именем 'ТоварыЦена'
И в таблице 'Товары' в поле с именем 'ТоварыЦена' я ввожу текст "200,00"
И в таблице 'Товары' я завершаю редактирование строки
И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
И в таблице 'Товары' я активизирую поле с именем 'ТоварыНоменклатура'
И в таблице 'Товары' я нажимаю кнопку выбора у реквизита с именем 'ТоварыНоменклатура'
Тогда открылось окно "Номенклатура"
И в таблице 'СписокРасширенныйПоискНоменклатура' я перехожу к строке:
	| "Наименование"   |
	| "_Лист стальной" |
И в таблице 'СписокРасширенныйПоискНоменклатура' я выбираю текущую строку
Тогда открылось окно "Заказ поставщику (создание) *"
И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличествоУпаковок'
И в таблице 'Товары' в поле с именем 'ТоварыКоличествоУпаковок' я ввожу текст "3,000"
И в таблице 'Товары' я активизирую поле с именем 'ТоварыЦена'
И в таблице 'Товары' в поле с именем 'ТоварыЦена' я ввожу текст "300,00"
И в таблице 'Товары' я завершаю редактирование строки
И из выпадающего списка с именем 'Статус' я выбираю точное значение "Подтвержден"
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна "Заказ поставщику (создание) *" в течение 10 секунд
Тогда открылось окно "Заказы поставщикам"
И в таблице 'Список' я нажимаю на кнопку с именем 'ПодменюСоздатьНаОснованииОбычное__4'
Тогда открылось окно "Приобретение товаров и услуг (создание)"
И я перехожу к закладке с именем 'ГруппаТовары'
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна "Приобретение товаров и услуг (создание)" в течение 10 секунд
Тогда открылось окно "Приобретение товаров и услуг 0000-000012 от *"
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна "Приобретение товаров и услуг 0000-000012 от *" в течение 10 секунд
